#+title: TODO

* TODO [#B] =cconv.el --- Closure conversion for statically scoped Emacs Lisp=

Emacs offloads lexical scope analysis to =cconv.el=: =(function ...)= will call
=internal-make-interpreted-closure-function= (set to
=cconv-make-interpreted-closure=) to prune the AST and captured variables:

#+begin_src elisp
  (defmacro test-cconv-macroexp (x) (list '+ x 'y))
  (cconv-make-interpreted-closure
   ;; args
   '(a b c)
   ;; body
   '((+ (test-cconv-macroexp x) a b c))
   ;; env
   '((x . 1) (y . 1) (z . 1))
   nil nil)
#+end_src

#+RESULTS:
: #[(a b c) ((+ (+ x y) a b c)) ((x . 1) (y . 1))]

Note that in the example above, the function body is replaced with a
macroexpanded version, and the environment is pruned from =((x . 1) (y . 1) (z .
1))= to =((x . 1) (y . 1))=.

To support this, we will need to rethink how we handle our materialized frames.

